In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
data = {'a':[1,2,3],
        'b':[4,6,7]}

In [6]:
df = pd.DataFrame(data)

In [7]:
df

   a  b
0  1  4
1  2  6
2  3  7

In [8]:
df = pd.DataFrame(data,columns = ['a','b','c'])

In [9]:
df

   a  b    c
0  1  4  NaN
1  2  6  NaN
2  3  7  NaN

In [10]:
df = pd.DataFrame(data,
                  columns = ['a','b','d'],
                  index = ['one','two','three'])

In [11]:
df

       a  b    d
one    1  4  NaN
two    2  6  NaN
three  3  7  NaN

In [21]:
dic = {'a':{'one':1,'two':3},
      'b':{'two':4,'one':2}}

In [22]:
df = pd.DataFrame(dic)

In [23]:
df

     a  b
one  1  2
two  3  4

In [24]:
df['c'] = np.nan

In [25]:
df

     a  b   c
one  1  2 NaN
two  3  4 NaN

In [26]:
df.drop(['c'],axis = 1)

     a  b
one  1  2
two  3  4

In [29]:
df.drop(['one'])

     a  b   c
two  3  4 NaN

In [30]:
df

     a  b   c
one  1  2 NaN
two  3  4 NaN

In [32]:
df.loc[['one'],['a']] = 100

In [33]:
df

       a  b   c
one  100  2 NaN
two    3  4 NaN

In [35]:
df.loc[['two'],['b']]

     b
two  4

In [36]:
df

       a  b   c
one  100  2 NaN
two    3  4 NaN

In [38]:
pd.isnull(df).sum()

a    0
b    0
c    2
dtype: int64

In [39]:
pd.isnull(df.sum())

a    False
b    False
c    False
dtype: bool

In [40]:
df.dropna(how = "any")

Empty DataFrame
Columns: [a, b, c]
Index: []

In [41]:
df.dropna(how = "all")

       a  b   c
one  100  2 NaN
two    3  4 NaN

In [43]:
df.fillna(method='ffill',axis = 1)

         a    b    c
one  100.0  2.0  2.0
two    3.0  4.0  4.0

In [44]:
from datetime import datetime

In [46]:
datetime(2222,11,11)

datetime.datetime(2222, 11, 11, 0, 0)